HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionSimpleFoam/heatExchanger/0.orig/air/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 100000;
    }
    inlet
    {
        type            calculated;
        value           uniform 100000;
    }
    outlet
    {
        type            calculated;
        value           uniform 100000;
    }
    blades
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
