HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionSimpleFoam/heatExchanger/system/air/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

MRF1
{
    type        MRFSource;
    active      yes;

    MRFSourceCoeffs
    {
        selectionMode cellZone;
        cellZone    rotor;
        referenceFrame rotatingFrame;
    }
}

airToporous
{
    type            constantHeatTransfer;

    interpolationMethod cellVolumeWeight;
    nbrRegion       porous;
    master          false;

    nbrModel        porousToair;
    semiImplicit    no;
}

porosityBlockage
{
    type            interRegionExplicitPorositySource;

    interRegionExplicitPorositySourceCoeffs
    {
        interpolationMethod cellVolumeWeight;
        nbrRegion       porous;

        type            DarcyForchheimer;

        d   (-1000 -1000 1e4);
        f   (0 0 0);
        referenceFrame porousFrame;
    }
}


// ************************************************************************* //
