HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionSimpleFoam/heatExchanger/system/air/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

materialType    fluid;
muModel         scalarFunction1;
kappaModel      scalarFunction1;
thermodynamics  hPolynomial;
equationOfState icoPolynomial;
energy          sensibleEnthalpy;
molWeight       28.85;

equationOfStateCoeffs
{
    rhoCoeffs    ( 4.0097 -0.016954 3.3057e-05 -3.0042e-08 1.0286e-11 0 0 0 );
}
thermodynamicsCoeffs
{
    Hf              0;
    Sf              0;
    CpCoeffs       ( 948.76 0.39171 -0.00095999 1.393e-06 -6.2029e-10 0 0 0 );
}
muModelCoeffs
{
    mu polynomial ( ( 1.5061e-06 0 ) ( 6.16e-08 1 ) (-1.819e-11 2)  );
}
kappaModelCoeffs
{
    kappa polynomial ( ( 0.0025219 0 ) ( 8.506e-05 1 ) (-1.312e-08 2)  );
}

// ************************************************************************* //
