HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionSimpleFoam/heatExchanger/system/air/topoSetDict.2
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // rotor cell zone
    {
        name    rotorCells;
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            name    cylinder;
        }
    }
    {
        name    rotorCells;
        type    cellSet;
        action  add;
        source  zoneToCell;
        sourceInfo
        {
            name    innerCylinder;
        }
    }
    {
        name    rotorCells;
        type    cellSet;
        action  subset;
        source  boxToCell;
        sourceInfo
        {
            box (-100 -100 0.1) (100 100 0.15);
        }
    }
    {
        name    rotor;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set rotorCells;
        }
    }
);


// ************************************************************************* //
